---
kind: property
id: P:Autodesk.Revit.DB.IViewSheetSet.SheetOrganizationId
source: html/69873730-6de8-19d4-eef7-ae05d8990856.htm
---
# Autodesk.Revit.DB.IViewSheetSet.SheetOrganizationId Property

ElementId to the BrowserOrganization for sheets.

## Syntax (C#)
```csharp
ElementId SheetOrganizationId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the ElementId does not reference to BrowserOrganization , or the target type of BrowserOrganization is incompatible.